/*----------------------------------------------------------------------------------------------------
#	THIS FILE IS PART OF XEROLYSKINNER'S PROJECT
#
#	THIS PROGRAM IS FREE SOFTWARE
#
#	E-mail:ZABBCCCBBAZ@163.com
#	QQ:2715099320
#
#	Copyright (c) 2022 XerolySkinner
#	All rights reserved.
*/

/*----------------------------------------------------------------------------------------------------
	名字:template
	时间:20220413-0014
	程序员:梁源康
	说明:主控程序
*/

//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	头文件
#include "vartable.h"
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	程序
//	
void mainInit(void){
	uint8_t data_buff;
	HAL_TIM_Base_Start_IT(&htim2);
	HAL_UART_Receive_IT(&huart1,&data_buff,1);
	HAL_UART_Receive_IT(&huart2,&data_buff,1);
	HAL_UART_Receive_IT(&huart3,&data_buff,1);
	return;}

void mainCore(void){
	text(">> 进入主程序\n");
	while(1){
	}
}
